[
  {
    "id": 201,
    "name": "Prada Chocolate Brushed Loafer",
    "brand": "Prada",
    "category": "Formal",
    "price": 1150.00,
    "rating": 4.9,
    "reviews": 320,
    "sku": "PRD-CHOC-BLK",
    "stock_quantity": 14,
    "description1": "A masterpiece of silhouette and shine; the silent roar of modern Italian elegance.",
    "description2": "These iconic loafers are crafted from Prada's signature brushed leather. Featuring the enameled metal triangle logo, they sit on a chunky rubber lug sole that perfectly balances traditional formal wear with a contemporary, architectural edge. Ideal for gala events or high-stakes boardroom meetings.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-1.jpg"
  },
  {
    "id": 202,
    "name": "Puma Velocity Nitro 3",
    "brand": "Puma",
    "category": "Sports",
    "price": 135.00,
    "rating": 4.5,
    "reviews": 1150,
    "sku": "PUM-VEL-NIT3",
    "stock_quantity": 42,
    "description1": "Effortless speed meets explosive cushioning for the runner who never looks back.",
    "description2": "The Velocity Nitro 3 is Puma's premier daily trainer for 2026. It utilizes nitrogen-infused NITROfoam for incredible responsiveness and PUMAGRIP for multi-surface traction. The engineered mesh upper provides targeted support and breathability for long-distance comfort.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-2.jpg"
  },
  {
    "id": 203,
    "name": "Adidas Ultraboost Light",
    "brand": "Adidas",
    "category": "Sports",
    "price": 190.00,
    "rating": 4.7,
    "reviews": 2800,
    "sku": "ADI-UB-LGT",
    "stock_quantity": 55,
    "description1": "Epic energy in every stride; a cloud-like journey through the city streets.",
    "description2": "The Ultraboost Light is the lightest version of this legend yet. Featuring a new generation of Light BOOST capsules, it provides 10% more energy return than previous models. The Primeknit+ upper is made with at least 50% Parley Ocean Plastic, blending performance with sustainability.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-3.jpg"
  },
  {
    "id": 204,
    "name": "Nike Air Zoom Pegasus 42",
    "brand": "Nike",
    "category": "Sports",
    "price": 140.00,
    "rating": 4.6,
    "reviews": 4100,
    "sku": "NKE-PEG-42",
    "stock_quantity": 80,
    "description1": "A reliable workhorse with wings; the gold standard of the morning run.",
    "description2": "The 42nd edition of the Pegasus remains the most trusted neutral runner in the world. Dual Zoom Air units and a ReactX foam midsole provide a snappy, energetic ride. The redesigned midfoot band provides a secure fit that conforms to the shape of your arch.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-4.jpg"
  },
  {
    "id": 205,
    "name": "Nike Vaporfly 4",
    "brand": "Nike",
    "category": "Sports",
    "price": 260.00,
    "rating": 4.8,
    "reviews": 950,
    "sku": "NKE-VPF-4",
    "stock_quantity": 12,
    "description1": "Racing's fastest pulse; a carbon-fiber invitation to break your personal best.",
    "description2": "Built for record-breaking speed, the Vaporfly 4 features a full-length carbon fiber Flyplate and ZoomX foam. The ultra-thin Flyknit upper reduces weight to the absolute minimum, providing a propulsive sensation that feels like being flung forward with every step.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-5.jpg"
  },
  {
    "id": 206,
    "name": "Adidas Adizero Adios Pro 4",
    "brand": "Adidas",
    "category": "Sports",
    "price": 250.00,
    "rating": 4.4,
    "reviews": 620,
    "sku": "ADI-ADI-PRO4",
    "stock_quantity": 18,
    "description1": "Engineered for podiums; where light-speed technology meets marathon endurance.",
    "description2": "The Adios Pro 4 utilizes ENERGYRODS 2.0 to limit energy loss and optimize stiffness. Two layers of resilient Lightstrike Pro foam cushion every landing, making this the preferred choice for elite marathoners seeking maximum efficiency over 26.2 miles.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-6.jpg"
  },
  {
    "id": 207,
    "name": "Prada Soft Padded Loafer",
    "brand": "Prada",
    "category": "Casual",
    "price": 975.00,
    "rating": 4.3,
    "reviews": 110,
    "sku": "PRD-SOFT-LOAF",
    "stock_quantity": 9,
    "description1": "A gentle embrace of nappa leather; the softest whisper of high-end leisure.",
    "description2": "Redefining casual luxury, these loafers are made from padded nappa leather for a distinctive 'pillow' effect. The minimalist design features a tonal triangle logo and a thin, flexible leather sole, offering unmatched comfort for relaxed social gatherings or travel.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-7.jpg"
  },
  {
    "id": 208,
    "name": "Puma Suede Classic XXI",
    "brand": "Puma",
    "category": "Casual",
    "price": 75.00,
    "rating": 4.2,
    "reviews": 5400,
    "sku": "PUM-SUE-CLX",
    "stock_quantity": 120,
    "description1": "A street-style icon since 1968; the timeless rhythm of the asphalt.",
    "description2": "The Suede Classic XXI stays true to the original silhouette that defined hip-hop culture. Featuring a full suede upper and the iconic Puma Formstrip, these sneakers offer a low-profile look that pairs perfectly with denim or joggers for an effortless everyday style.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-8.jpg"
  },
  {
    "id": 209,
    "name": "Reebok Nano X5",
    "brand": "Reebok",
    "category": "Sports",
    "price": 150.00,
    "rating": 4.1,
    "reviews": 890,
    "sku": "RBK-NAN-X5",
    "stock_quantity": 35,
    "description1": "The ultimate box companion; stability and strength forged for the gym floor.",
    "description2": "The Nano X5 is designed for the multi-disciplinary athlete. With a Floatride Energy foam forefoot and a Lift and Run (L.A.R) chassis system, it provides the stability needed for heavy squats while maintaining the flexibility for sprints and jumps.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-9.jpg"
  },
  {
    "id": 210,
    "name": "Puma Deviate Nitro 3",
    "brand": "Puma",
    "category": "Sports",
    "price": 170.00,
    "rating": 4.8,
    "reviews": 430,
    "sku": "PUM-DEV-NIT3",
    "stock_quantity": 25,
    "description1": "A carbon-plated beast for the daily grind; redefine your limits every morning.",
    "description2": "The Deviate Nitro 3 brings elite racing technology to your daily training. A full-length PWRPLATE carbon fiber plate provides maximum energy transfer, while the thick stack of NITROfoam Elite offers premium cushioning that protects your legs during high-intensity intervals.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-10.jpg"
  },
  {
    "id": 211,
    "name": "Prada Monolith Leather Loafer",
    "brand": "Prada",
    "category": "Casual",
    "price": 1250.00,
    "rating": 4.7,
    "reviews": 410,
    "sku": "PRD-MONO-LOAF",
    "stock_quantity": 7,
    "description1": "An architectural marvel for the feet; bold, brave, and undeniably Prada.",
    "description2": "The Monolith loafer is defined by its exaggerated, oversized lug sole—a hallmark of Prada's recent design language. Crafted from premium spazzolato leather, this shoe turns a traditional casual silhouette into a high-fashion statement piece that commands attention.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-11.jpg"
  },
  {
    "id": 212,
    "name": "Nike Invincible 4",
    "brand": "Nike",
    "category": "Sports",
    "price": 185.00,
    "rating": 4.9,
    "reviews": 1250,
    "sku": "NKE-INV-4",
    "stock_quantity": 30,
    "description1": "The cushion that never quits; a luxurious sanctuary for your recovery miles.",
    "description2": "The Invincible 4 is built for maximum protection. Featuring Nike's highest stack of ZoomX foam, it provides a soft, bouncy, and stable ride. It is specifically designed to keep runners on the road by absorbing impact and reducing leg fatigue during easy and long runs.",
    "image": "https://res.cloudinary.com/duf2jzwsg/image/upload/v1/footwear/shoe-12.jpg"
  }
]
